```
Fri Sep  8 18:21:49 EDT 2023 terraform-provider-vault/testtf - (codergs-hcp-oracle-add) > terraform plan   
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vault in /Users/gsharma/.terraform.d/plugins
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_database_secrets_mount.oracle-mount will be created
  + resource "vault_database_secrets_mount" "oracle-mount" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + engine_count                 = 1
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "db"
      + seal_wrap                    = (known after apply)

      + oracle {
          + allowed_roles        = [
              + "default",
            ]
          + connection_url       = "{{username}}/{{password}}@localhost:1521/OraDoc.localhost"
          + max_open_connections = 2
          + name                 = "oracledb1"
          + password             = (sensitive value)
          + plugin_name          = "vault-plugin-database-oracle"
          + username             = "test"
          + verify_connection    = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply"
now.
Fri Sep  8 18:21:54 EDT 2023 terraform-provider-vault/testtf - (codergs-hcp-oracle-add) > terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vault in /Users/gsharma/.terraform.d/plugins
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_database_secrets_mount.oracle-mount will be created
  + resource "vault_database_secrets_mount" "oracle-mount" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + engine_count                 = 1
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "db"
      + seal_wrap                    = (known after apply)

      + oracle {
          + allowed_roles        = [
              + "default",
            ]
          + connection_url       = "{{username}}/{{password}}@localhost:1521/OraDoc.localhost"
          + max_open_connections = 2
          + name                 = "oracledb1"
          + password             = (sensitive value)
          + plugin_name          = "vault-plugin-database-oracle"
          + username             = "test"
          + verify_connection    = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vault_database_secrets_mount.oracle-mount: Creating...
vault_database_secrets_mount.oracle-mount: Creation complete after 0s [id=db]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Fri Sep  8 18:22:04 EDT 2023 terraform-provider-vault/testtf - (codergs-hcp-oracle-add) > terraform destroy
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vault in /Users/gsharma/.terraform.d/plugins
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵
vault_database_secrets_mount.oracle-mount: Refreshing state... [id=db]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # vault_database_secrets_mount.oracle-mount will be destroyed
  - resource "vault_database_secrets_mount" "oracle-mount" {
      - accessor                     = "database_0d965f06" -> null
      - allowed_managed_keys         = [] -> null
      - audit_non_hmac_request_keys  = [] -> null
      - audit_non_hmac_response_keys = [] -> null
      - default_lease_ttl_seconds    = 0 -> null
      - engine_count                 = 1 -> null
      - external_entropy_access      = false -> null
      - id                           = "db" -> null
      - local                        = false -> null
      - max_lease_ttl_seconds        = 0 -> null
      - options                      = {} -> null
      - path                         = "db" -> null
      - seal_wrap                    = false -> null

      - oracle {
          - allowed_roles            = [
              - "default",
            ] -> null
          - connection_url           = "{{username}}/{{password}}@localhost:1521/OraDoc.localhost" -> null
          - data                     = {} -> null
          - max_connection_lifetime  = 0 -> null
          - max_idle_connections     = 0 -> null
          - max_open_connections     = 2 -> null
          - name                     = "oracledb1" -> null
          - password                 = (sensitive value) -> null
          - plugin_name              = "vault-plugin-database-oracle" -> null
          - root_rotation_statements = [] -> null
          - username                 = "test" -> null
          - verify_connection        = false -> null
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

vault_database_secrets_mount.oracle-mount: Destroying... [id=db]
vault_database_secrets_mount.oracle-mount: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.
```